app/views/games/_form.html.erb

    <%= f.label :variant_id %><br />
    <%= f.collection_select :variant_id, Variant.all, :id, :name %>
---
SELECT "variants".* FROM "variants"