app/controllers/games_controller.rb

  def edit
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "67"]]

  def import
    GamesImport.new(params[:file], current_user).create_records
---
INSERT INTO "games" ("buyin", "casino_id", "created_at", "prize", "updated_at", "user_id", "variant_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["buyin", 100], ["casino_id", 2], ["created_at", Sun, 22 Dec 2013 09:01:00 UTC +00:00], ["prize", 300], ["updated_at", Sun, 22 Dec 2013 09:01:00 UTC +00:00], ["user_id", 1], ["variant_id", 1]]