app/views/stats/index.html.erb

SELECT "variants".* FROM "variants"
---
  </tr>
<% Variant.all.each do |variant| %>

SELECT "casinos".* FROM "casinos" WHERE "casinos"."user_id" = 1
---
  </tr>
  <% current_user.casinos.each do |casino| %>